       01 REG-TRANSACAO.
          05 TRX-ARQ-CLI-ID   PIC X(05).
          05 TRX-ARQ-ID       PIC X(05).
          05 TRX-ARQ-TIPO     PIC X(01).
          05 TRX-ARQ-VALOR    PIC X(09).
